Terraform plan for __production__
<details>
  <summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_limit_range.cluster_limit["promise-service"] will be created
  + resource "kubernetes_limit_range" "cluster_limit" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "default-limit"
          + namespace        = "promise-service"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "memory" = "1Gi"
                }
              + default_request = {
                  + "cpu"    = "200m"
                  + "memory" = "500Mi"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_namespace.gke_namespace["promise-service"] will be created
  + resource "kubernetes_namespace" "gke_namespace" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "promise-service"
            }
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
              + "project"         = "ebo-prod"
            }
          + name             = "promise-service"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #272](https://github.com/ebomart/commerce-infrastructure/actions/runs/1357900697)